# Proceso de EDA y ETL

In [1]:
# Importamos las librerias mas uriles para una limpieza
import yfinance as yf
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

Descargamos el DataFrame que contine todos los datos del S&P500 desde el perimer día del año 1992 hasta el ultimo día del año 2022, un total de 30 años

In [11]:
data = yf.download(tickers='^GSPC', start= '1992-01-01', end= '2022-12-31', interval= '1d')

[*********************100%***********************]  1 of 1 completed

In [12]:
data.info() # Revisamos los tipos de datos que hay
data.isna().sum()# Verificamos que no hay nulos
# Como podemos observar en los datos no hay números nulos

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 7809 entries, 1992-01-02 to 2022-12-30
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Open       7809 non-null   float64
 1   High       7809 non-null   float64
 2   Low        7809 non-null   float64
 3   Close      7809 non-null   float64
 4   Adj Close  7809 non-null   float64
 5   Volume     7809 non-null   int64
dtypes: float64(5), int64(1)
memory usage: 427.1 KB

Open         0
High         0
Low          0
Close        0
Adj Close    0
Volume       0
dtype: int64

In [13]:
data.head() # Procedemos a ordenar los datos.

,Open,High,Low,Close,Adj Close,Volume
Date,,,,,,
1992-01-02,417.029999,417.269989,411.040009,417.260010,417.260010,207570000
1992-01-03,417.269989,419.790009,416.160004,419.339996,419.339996,224270000
1992-01-06,419.309998,419.440002,416.920013,417.959991,417.959991,251210000
1992-01-07,417.959991,417.959991,415.200012,417.399994,417.399994,252780000
1992-01-08,417.359985,420.230011,415.019989,418.100006,418.100006,290750000

In [14]:
data= data.round(2)
# Dado que los datos de las columnas Open, High, Low, Close y Adj Close estan basados en dolares Estadounidences procederemos a 
# reducir su numero de decimales a 2

In [15]:
data.head()

              Open    High     Low   Close  Adj Close     Volume
Date
1992-01-02  417.03  417.27  411.04  417.26     417.26  207570000
1992-01-03  417.27  419.79  416.16  419.34     419.34  224270000
1992-01-06  419.31  419.44  416.92  417.96     417.96  251210000
1992-01-07  417.96  417.96  415.20  417.40     417.40  252780000
1992-01-08  417.36  420.23  415.02  418.10     418.10  290750000

In [16]:
# Por ultimo prodecemos a guardar el nuevo dataframe en un csv
data.to_csv(f'S&P500.csv')

###  Obtenemos los valores del patron oro y del yen japonés

In [11]:
# Valores del patron oro
oro = yf.download(tickers="GC=F", start= '2010-01-01', end= '2022-12-31', interval= '1d')

[*********************100%***********************]  1 of 1 completed

In [12]:
# Valores del indice Nikkei255
nikkei = yf.download(tickers="^N225", start= '2010-01-01', end= '2022-12-31', interval= '1d')

[*********************100%***********************]  1 of 1 completed

In [4]:
oro.info()
oro.isna().sum()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 3270 entries, 2010-01-04 to 2022-12-30
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Open       3270 non-null   float64
 1   High       3270 non-null   float64
 2   Low        3270 non-null   float64
 3   Close      3270 non-null   float64
 4   Adj Close  3270 non-null   float64
 5   Volume     3270 non-null   int64
dtypes: float64(5), int64(1)
memory usage: 178.8 KB

Open         0
High         0
Low          0
Close        0
Adj Close    0
Volume       0
dtype: int64

In [5]:
nikkei.info()
nikkei.isna().sum()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 3179 entries, 2010-01-04 to 2022-12-30
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Open       3179 non-null   float64
 1   High       3179 non-null   float64
 2   Low        3179 non-null   float64
 3   Close      3179 non-null   float64
 4   Adj Close  3179 non-null   float64
 5   Volume     3179 non-null   int64
dtypes: float64(5), int64(1)
memory usage: 173.9 KB

Open         0
High         0
Low          0
Close        0
Adj Close    0
Volume       0
dtype: int64

In [16]:
oro.head()

              Open    High     Low   Close  Adj Close  Volume
Date
2010-01-04  1117.7  1122.3  1097.1  1117.7     1117.7     184
2010-01-05  1118.1  1126.5  1115.0  1118.1     1118.1      53
2010-01-06  1135.9  1139.2  1120.7  1135.9     1135.9     363
2010-01-07  1133.1  1133.1  1129.2  1133.1     1133.1      56
2010-01-08  1138.2  1138.2  1122.7  1138.2     1138.2      54

In [19]:
nikkei.head()

                Open      High       Low     Close  Adj Close     Volume
Date
2010-01-04  10609.34  10694.49  10608.14  10654.79   10654.79  104400000
2010-01-05  10719.44  10791.04  10655.57  10681.83   10681.83  166200000
2010-01-06  10709.55  10768.61  10661.17  10731.45   10731.45  181800000
2010-01-07  10742.75  10774.00  10636.67  10681.66   10681.66  182600000
2010-01-08  10743.30  10816.45  10677.56  10798.32   10798.32  211800000

In [15]:
oro= oro.round(2)

In [18]:
nikkei= nikkei.round(2)

In [20]:
oro.to_csv(f'ORO.csv')

In [21]:
nikkei.to_csv(f'Nikkei.csv')